{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Metadata report describing a feature request and its associated components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Text file listing concise descriptions of all major frontend components and assets.",
  "frontend/cleanup-notes-non-frontend.md": "Audit notes for non‑frontend files, recommending verification before deleting root-level artifacts.",
  "frontend/cleanup-report.md": "Report detailing kept frontend assets and a list of deleted unused files with reasons.",
  "frontend/index.css": "Global Tailwind CSS setup defining color variables, themes, and base styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/README-assets.md": "Documentation of background images and background‑music.mp3, including playback behavior, browser compatibility, and diagnostics.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with the error boundary and background audio provider.",
  "frontend/src/assets/staticAssets.ts": "Exports paths for the three background images used by each page.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary displaying a fallback UI and refresh option on runtime errors.",
  "frontend/src/components/BackgroundAudioProvider.tsx": "Context provider managing autoplay, gesture-based playback, mute toggle, local file selection, and audio state syncing.",
  "frontend/src/components/CornerAudioPicker.tsx": "Provides a button to pick a local audio file, validates it, and shows status and selected filename.",
  "frontend/src/components/EnterWebsiteGate.tsx": "Shows an entry screen with animations and triggers audio on user gesture before revealing children.",
  "frontend/src/components/FullscreenBackground.tsx": "Renders a fullscreen background image with an overlay and displays child content on top.",
  "frontend/src/components/RomanticButton.tsx": "A stylized button component with adjustable size used for romantic-themed UI actions.",
  "frontend/src/components/RootLayout.tsx": "Wraps the app layout and renders routed content via an Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client creation, login state, and stored identity loading.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom colors, fonts, and animations used across the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider.",
  "frontend/src/pages/FinalPage.tsx": "Shows the final message page with long romantic text over a fullscreen background.",
  "frontend/src/pages/IntroPage.tsx": "Displays an intro screen with delayed CTA, wrapped in an entry gate and background image.",
  "frontend/src/pages/ProposalPage.tsx": "Shows a proposal prompt with a YES button that navigates to the final page.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, border radii, animations, and plugins for the app’s styling.",
  "project_state.json": "Defines the project state, existing issues, and feature requests related to restoring default background music behavior."
}