{
  "backend/main.mo": "Empty Motoko actor with no functions.",
  "feature_evidence.json": "Feature evidence report describing a background-image replacement feature and its components.",
  "frontend-file-summaries.txt": "List of short summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base styles defining romantic-themed CSS variables and applying global background and text rules.",
  "frontend/index.html": "HTML entry point containing a root div and script loading main.tsx.",
  "frontend/README-assets.md": "Guide explaining how to replace the three generated background images and notes that background music was removed.",
  "frontend/src/App.tsx": "Sets up TanStack Router with three routes wrapped in an error boundary.",
  "frontend/src/assets/staticAssets.ts": "Exports static paths for the three background images.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and shows a refresh prompt on failure.",
  "frontend/src/components/BackgroundAudioProvider.tsx": "Empty placeholder for an audio provider component.",
  "frontend/src/components/EnterWebsiteGate.tsx": "Animated heart-themed entry gate that reveals children after clicking Enter.",
  "frontend/src/components/FullscreenBackground.tsx": "Renders a full-screen letterboxed background image with a black overlay.",
  "frontend/src/components/RomanticButton.tsx": "Reusable romantic-styled button supporting default and small sizes.",
  "frontend/src/components/RootLayout.tsx": "Basic layout that renders nested routes via Outlet.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication using AuthClient.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, custom fonts, and multiple animation keyframes, forming the global styling foundation.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity providers, and renders the main App with global styles.",
  "frontend/src/pages/FinalPage.tsx": "Renders the final page with a background image and a long styled message, ending with a signature element.",
  "frontend/src/pages/IntroPage.tsx": "Displays the intro page with timed CTA reveal, styled title/paragraph, and navigation to the proposal page.",
  "frontend/src/pages/ProposalPage.tsx": "Shows a proposal question with themed background and a button that navigates to the final page.",
  "frontend/tailwind.config.js": "Extends Tailwind with custom colors, fonts, radii, keyframes, and animations tied to CSS variables.",
  "project_state.json": "Describes project state, pending feature requests, issues, and requirements for styling, assets, and background music."
}