{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files and components.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing major frontend files and their purposes.",
  "frontend/index.css": "Global Tailwind base styles defining romantic color variables and theming, including dark mode.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/README-assets.md": "Guide explaining how to replace the three background images and notes that music is removed.",
  "frontend/src/App.tsx": "Configures TanStack Router with three pages and wraps the app in an error boundary.",
  "frontend/src/assets/staticAssets.ts": "Exports paths for three background images used across pages.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that displays a styled fallback UI and reload button on errors.",
  "frontend/src/components/BackgroundAudioProvider.tsx": "Empty placeholder file for audio provider.",
  "frontend/src/components/EnterWebsiteGate.tsx": "Love‑themed entry gate with animated hearts requiring user interaction before showing content.",
  "frontend/src/components/FullscreenBackground.tsx": "Full‑screen background wrapper rendering letterboxed images with a dark overlay.",
  "frontend/src/components/RomanticButton.tsx": "Reusable romantic‑styled button supporting default and small size variants.",
  "frontend/src/components/RootLayout.tsx": "Root layout containing an Outlet for nested route rendering.",
  "frontend/src/hooks/useActor.ts": "Hook creating backend actors based on identity and refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider managing login, identity loading, and status flags.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, base styles, custom fonts, and multiple animation keyframes used across the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the App root component.",
  "frontend/src/pages/FinalPage.tsx": "Displays the final page with a background image and a long love letter plus a signature overlay.",
  "frontend/src/pages/IntroPage.tsx": "Shows the intro background, title, message, and a delayed CTA that navigates to the proposal page.",
  "frontend/src/pages/ProposalPage.tsx": "Renders the proposal question with a YES button that navigates to the final page.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, fonts, radii, and custom animations.",
  "project_state.json": "Stores project metadata, feature summaries, known issues, and build-related notes for the romantic multi-page site."
}