{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "JSON report listing three UI color‑update features affecting IntroPage.tsx with metadata and confidence levels.",
  "frontend-file-summaries.txt": "High-level text summaries of all frontend source files and their purposes.",
  "frontend/index.css": "Tailwind base file defining CSS variables, dark mode tokens, and applying global background/text styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README-assets.md": "Guide explaining how to replace background images and notes that music was removed.",
  "frontend/src/App.tsx": "Sets up TanStack Router with three routes and wraps them in an error boundary.",
  "frontend/src/assets/staticAssets.ts": "Exports paths to the three background images used by the pages.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches errors and shows a refresh UI.",
  "frontend/src/components/BackgroundAudioProvider.tsx": "Empty placeholder file for future audio provider logic.",
  "frontend/src/components/EnterWebsiteGate.tsx": "Pre-entry screen with animated hearts and a button revealing the site.",
  "frontend/src/components/FullscreenBackground.tsx": "Renders a full-screen letterboxed background image with a dark overlay.",
  "frontend/src/components/RomanticButton.tsx": "Reusable button component with wine-themed styling and size variants.",
  "frontend/src/components/RootLayout.tsx": "Simple layout wrapper that renders nested routes via Outlet.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing a backend actor based on Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider implementing Internet Identity auth via AuthClient.",
  "frontend/src/index.css": "Sets Tailwind layers, defines color variables, custom fonts, and several animation keyframes used across the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/FinalPage.tsx": "Displays the final message page with a background image, scrollable love letter text, and a styled signature.",
  "frontend/src/pages/IntroPage.tsx": "Renders the intro screen with timed CTA reveal, styled text, and navigation to the proposal page.",
  "frontend/src/pages/ProposalPage.tsx": "Shows a proposal prompt with a YES button that navigates to the final page, using background and animations.",
  "frontend/tailwind.config.js": "Extends Tailwind with custom colors, fonts, border radii, and animations sourced from CSS variables.",
  "project_state.json": "Defines project metadata, known color-update issues, and feature requests for updating IntroPage colors."
}