{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files, describing their roles in routing, UI, audio, styling, and assets.",
  "frontend/cleanup-notes-non-frontend.md": "Audit notes for non-frontend files, mainly recommending verification before deleting feature_evidence.json.",
  "frontend/cleanup-report.md": "Report listing kept and deleted frontend assets with reasons, focusing on storage cleanup and removal of unused files.",
  "frontend/index.css": "Global Tailwind-based styling with custom CSS variables, color tokens, and dark mode definitions.",
  "frontend/index.html": "HTML entry point defining the root DOM node and loading the React application.",
  "frontend/README-assets.md": "Documentation detailing background images, background music file, playback behavior, diagnostics, and technical implementation.",
  "frontend/src/App.tsx": "Main React app wiring TanStack Router routes and wrapping them with the error boundary and background audio provider.",
  "frontend/src/assets/staticAssets.ts": "Exports fixed paths for the three background images used across the site.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and displays a refresh prompt when failures occur.",
  "frontend/src/components/BackgroundAudioProvider.tsx": "Provides a context-based background audio player with autoplay attempts, gesture-based playback, mute toggle, and error handling.",
  "frontend/src/components/EnterWebsiteGate.tsx": "Displays an entry gate screen with animated hearts and triggers background audio on user gesture before showing children.",
  "frontend/src/components/FullscreenBackground.tsx": "Renders a full-screen background image with a dark overlay and displays children on top.",
  "frontend/src/components/RomanticButton.tsx": "A stylized romantic button component with configurable size and hover effects.",
  "frontend/src/components/RootLayout.tsx": "Basic layout wrapper rendering nested routes via Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login flow, and managing AuthClient.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, fonts, and custom animations including heart-floating effects.",
  "frontend/src/main.tsx": "Initializes React root with query client and Internet Identity provider, then renders App.",
  "frontend/src/pages/FinalPage.tsx": "Shows a full-screen background with a long romantic message and a signature overlay.",
  "frontend/src/pages/IntroPage.tsx": "Displays intro screen with delayed CTA and background, using EnterWebsiteGate and navigating to the proposal page.",
  "frontend/src/pages/ProposalPage.tsx": "React page showing a marriage proposal with a background image and a YES button that navigates to /final.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, border radii, animations, and including animate and typography plugins.",
  "project_state.json": "JSON describing project state, issues, and feature requests related to autoplay background music using a specific audio file."
}