{
  "kind": "build_request",
  "title": "Restyle enter gate with heart animations, improve Final page readability, and reduce YES button size",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Update Page 3 (Final page) so the long message text and the signature are pure white and easy to read: remove the shimmer/shine animation from the message, keep the existing fonts, and ensure the signature uses the same font as before but is also pure white.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All text pure white with same font along with signature",
          "on page 3 those tax is not readable remove the shine and and make them just White and easy to read"
        ]
      },
      "acceptanceCriteria": [
        "On /final, the long message is rendered in solid white (no shimmer/metallic/shine animation).",
        "On /final, the signature “- YOUR ARSU” is rendered in solid white and retains its existing font family styling.",
        "Page 3 remains vertically scrollable and preserves existing line breaks (whitespace-pre-wrap behavior remains intact)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Make the Page 2 “YES” button slightly smaller while keeping the existing romantic styling (same colors, rounded shape, hover behavior, and general look).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "on page to make yes button little smaller"
        ]
      },
      "acceptanceCriteria": [
        "On /proposal, the YES button is visibly smaller than before (reduced padding and/or font size), while retaining the same styling and hover/transition behavior.",
        "Clicking YES still navigates to /final."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Restyle the pre-Page-1 “Enter the Website” gate screen to feel more love/Valentine-themed using love colors and animated hearts, while keeping the same gate behavior (user must click/tap to enter the site).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Restyle with love colours and animation like heart",
          "make intro in love them which is now just shows enter the website in white colour and Balck background"
        ]
      },
      "acceptanceCriteria": [
        "Before entering the site, the gate screen shows a love-themed visual style (romantic/love colors) rather than a plain black/white appearance.",
        "The gate screen includes heart-themed animation(s) visible on both desktop and mobile.",
        "Clicking/tapping “Enter the Website” still dismisses the gate and reveals the existing 3-page flow unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components must be composed, not modified).",
    "Do not modify immutable hook/bootstrap files listed in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts).",
    "Keep the existing full-screen background rendering rules: background-size contain (letterbox), centered, no-repeat, with a black translucent overlay.",
    "Backend remains single-actor Motoko; do not introduce additional backend services or external databases.",
    "Use English for any user-facing text changed/added as part of these updates."
  ],
  "nonGoals": [
    "Re-enabling or adding background music/audio playback.",
    "Changing routing structure beyond what is required for the styling updates.",
    "Changing or regenerating the three background images beyond the already-established asset replacement/mapping behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}