{
  "kind": "build_request",
  "title": "Set 'Soch Na Sake…' as default autoplay track and move song picker to top",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Set the site’s default background music to the uploaded song whose filename starts with \"Soch Na Sake\" by making that track the runtime default audio asset at `frontend/public/assets/background-music.mp3` (replace/update the existing default music file as needed) while keeping the local file picker feature available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Build it and add the song as default \nSong file name starts from \"Soch Na sake....\""
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load (no prior interaction), the app’s default audio source is `'/assets/background-music.mp3'` and it corresponds to the uploaded track starting with \"Soch Na Sake\".",
        "The app still allows users to choose a local audio file and switches playback to the chosen file as it does today.",
        "If the default asset cannot be loaded, the UI shows an English status message indicating the default audio is unavailable and instructs the user to choose a song file."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the default track attempts to auto-play immediately when the user opens the site, with the existing graceful fallback behavior (play-on-gesture via the Enter gate, and a visible manual \"Play Music\" button if needed) preserved.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "2. Auto play immediately when user open the site",
          "Build it and add the song as default \nSong file name starts from \"Soch Na sake....\""
        ]
      },
      "acceptanceCriteria": [
        "When the site loads, an autoplay attempt is made without requiring navigation or additional clicks.",
        "If the browser blocks autoplay, clicking \"Enter the Website\" triggers a playback attempt.",
        "If autoplay and gesture-based playback both fail, a \"Play Music\" button appears and starts playback when clicked."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Move the song selection control (the fixed-position song picker bar/button) from the bottom of the page to the upper side (top) of the page, without covering the existing top-right play/mute controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "And one more thing place this song selection baar in upper side not in bottom"
        ]
      },
      "acceptanceCriteria": [
        "The song picker UI is positioned at the top of the viewport (not bottom) across all routes.",
        "The song picker does not overlap the top-right play/mute UI controls at common viewport sizes (mobile and desktop).",
        "All user-facing labels in the song picker remain in English (e.g., \"Choose Song\", status messages)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose them instead).",
    "Do not modify immutable hook/bootstrap files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Add a backend upload endpoint or persist user audio files on-chain.",
    "Add third-party audio streaming integrations or external storage.",
    "Implement playlists, multiple saved tracks, or account-based music preferences."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}