{
  "kind": "build_request",
  "title": "Apply confirmed Page 1/2 styling updates, swap Page 1 background, and re-enable background music",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update Page 1 (IntroPage) typography and placement: keep the title in the same horizontal position, make the title larger, and move it slightly downward; also increase the paragraph font size. Keep Page 1 title color as wine and paragraph color as unicorn silver.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Page 1 tittle Not higher or left just let it where it is And make it little big and place little downside"
        ]
      },
      "acceptanceCriteria": [
        "On Page 1, the title is visibly larger than before and sits slightly lower than its previous position, without shifting left/right.",
        "On Page 1, the paragraph font size is increased compared to the current deployed version.",
        "Page 1 title uses the wine color token and the paragraph uses the unicorn silver color token."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the Page 1 background image with the newly uploaded image by updating the app to reference the generated background asset for Page 1 (and ensure the image is served from the frontend static assets path).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And replace page 1 backround image with this new image"
        ]
      },
      "acceptanceCriteria": [
        "Page 1 displays the new background image instead of the current one.",
        "Background rendering rules remain unchanged: centered, no-repeat, contain/letterbox, with the black translucent overlay above the image and behind content."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Change the Page 1 navigation CTA (the control that takes the user from Page 1 to Page 2) to use the Kaitoke color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And in page 1 the button which used to go on page 2 make it in kaitoke colour"
        ]
      },
      "acceptanceCriteria": [
        "The Page 1 CTA that navigates to '/proposal' renders with a Kaitoke-colored background (or primary accent) in its default state.",
        "The CTA remains clearly readable against its background after the color change."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Set the Page 2 proposal question line color to Barbie Pink.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Page 2 proposal line color = Barbie Pink"
        ]
      },
      "acceptanceCriteria": [
        "On Page 2, the 'Will you marry me ?' heading renders in Barbie Pink."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add background music playback for a track named \"Soch_Na_Sake...\" that loops continuously, has no visible controls, and continues playing uninterrupted across navigation from Page 1 → Page 2 → Page 3. Ensure playback starts only after a user interaction (use the existing EnterWebsiteGate interaction) to satisfy browser autoplay restrictions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And add a background music \"Soch_Na_Sake..."
        ]
      },
      "acceptanceCriteria": [
        "After the user completes the EnterWebsiteGate interaction, the background music starts and loops.",
        "Navigating between routes ('/', '/proposal', '/final') does not stop or restart the audio (no audible interruption).",
        "No audio controls are visible in the UI."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Address the reported issue that a successful deploy showed no visible changes by ensuring the updated assets and styling are actually the ones referenced at runtime (e.g., update static asset paths used by the pages so they point to the replaced/generated files, and remove any stale references).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "But nothing changed",
          "everything looks untouched"
        ]
      },
      "acceptanceCriteria": [
        "After rebuild, Page 1 background, Page 1 CTA color, Page 1 title/paragraph sizing/placement, and Page 2 heading color all reflect the requested changes in the live preview.",
        "No page continues to reference the old Page 1 background path once the replacement is applied."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only).",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the backend as-is (backend/main.mo remains a single empty actor unless a new backend requirement is explicitly needed).",
    "All user-facing text in the app must remain in English only where new user-facing text is introduced by these changes."
  ],
  "nonGoals": [
    "Adding new pages or changing the existing 3-route structure.",
    "Changing the letterbox/contain background behavior or removing the black overlay.",
    "Adding third-party audio streaming or external integrations; audio must be a bundled static asset."
  ],
  "imageRequirements": {
    "required": [
      "Page 1 full-screen background image (bg-page-1.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}