{
  "kind": "build_request",
  "title": "Fix missing default background music asset and restore autoplay fallback behavior",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add the default background music file at `frontend/public/assets/background-music.mp3` so the app no longer shows the error message about default music being unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Why it says default music not available",
          "Fix it",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/public/assets/background-music.mp3` exists in the built frontend output and is fetchable at runtime via `/assets/background-music.mp3`.",
        "On a fresh load, the UI does not display the status message \"Default audio unavailable. Please choose a song file to play.\" when the default asset is present.",
        "No console error event is emitted from the `<audio>` element due to missing `/assets/background-music.mp3`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure `BackgroundAudioProvider` continues to use `/assets/background-music.mp3` as the default source and that the existing playback behavior remains intact (autoplay attempt on load, play-on-user-gesture via the entry gate, and manual \"Play Music\" fallback button if needed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Fix it",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "On page load, the app attempts to autoplay the default track (a blocked autoplay is handled without crashing).",
        "If autoplay is blocked, clicking the app’s entry/gesture control triggers playback (where browser policy permits).",
        "If playback still fails after a gesture attempt, a visible \"Play Music\" button appears and attempts to start playback when clicked.",
        "The local file picker remains available and can override the default track by selecting a local audio file."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only UI sources).",
    "Do not modify `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (immutable paths).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new backend canister logic (the backend is currently unused for audio).",
    "Adding third-party audio streaming or external storage.",
    "Changing the existing page flow/routes (/, /proposal, /final) beyond what is required to fix default music availability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}