{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Love-themed gate restyle, Final page readability fixes, and smaller YES button",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Make the Final page message and signature solid pure white, remove shimmer animation, and preserve existing fonts and scroll/line-break behavior.",
      "acceptanceCriteria": [
        "On /final, the long message is rendered in solid white (no shimmer/metallic/shine animation).",
        "On /final, the signature “- YOUR ARSU” is rendered in solid white and retains its existing font family styling.",
        "Page 3 remains vertically scrollable and preserves existing line breaks (whitespace-pre-wrap behavior remains intact)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FinalPage.tsx",
          "operation": "modify",
          "description": "Remove the shimmer/shine styling from the long message (drop animate-shimmer) and render both the message and signature in solid pure white while keeping the existing font classes and whitespace-pre-wrap/scroll container behavior intact."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Reduce the YES button size on the Proposal page without changing its romantic styling or navigation behavior.",
      "acceptanceCriteria": [
        "On /proposal, the YES button is visibly smaller than before (reduced padding and/or font size), while retaining the same styling and hover/transition behavior.",
        "Clicking YES still navigates to /final."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RomanticButton.tsx",
          "operation": "modify",
          "description": "Add support for a smaller size option (e.g., via an optional prop or className override) that only adjusts sizing tokens (padding/font-size) while keeping the same colors, rounded shape, backdrop-blur, and hover/transition behavior."
        },
        {
          "path": "frontend/src/pages/ProposalPage.tsx",
          "operation": "modify",
          "description": "Use the updated RomanticButton sizing API (or pass an override) so the YES button renders slightly smaller on /proposal while preserving the existing click handler that navigates to /final."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Restyle the Enter Website gate with a Valentine/love theme and visible animated hearts on desktop and mobile while keeping the same enter-to-dismiss behavior.",
      "acceptanceCriteria": [
        "Before entering the site, the gate screen shows a love-themed visual style (romantic/love colors) rather than a plain black/white appearance.",
        "The gate screen includes heart-themed animation(s) visible on both desktop and mobile.",
        "Clicking/tapping “Enter the Website” still dismisses the gate and reveals the existing 3-page flow unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EnterWebsiteGate.tsx",
          "operation": "modify",
          "description": "Update the gate screen styling to a more Valentine/love-themed look (romantic gradients/overlays) and render decorative heart elements behind/around the content; keep the current state-driven gate behavior and Enter button click-to-dismiss unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add heart-themed animation keyframes and utility classes used by EnterWebsiteGate (e.g., floating/drifting hearts, gentle pulsing), ensuring the hearts are visible on both desktop and mobile and do not affect the existing full-screen background rendering rules elsewhere."
        }
      ]
    }
  ]
}