{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "IntroPage exact hex color updates (wine heading, unicorn silver body, thyme CTA)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Set IntroPage main heading color to exact hex #722F37 using a Tailwind arbitrary color class (not theme tokens).",
      "acceptanceCriteria": [
        "On the Intro page, the main heading renders in hex color #722F37.",
        "The change is visible in the browser and is not dependent on existing theme tokens such as `text-wine`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IntroPage.tsx",
          "operation": "modify",
          "description": "Replace the heading text color class currently using a theme token (e.g., `text-wine`) with a Tailwind arbitrary value class that renders exactly #722F37 (e.g., `text-[#722F37]`). Ensure no copy/content changes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Set IntroPage body paragraph color to exact hex #E8E8E8 using a Tailwind arbitrary color class (not theme tokens).",
      "acceptanceCriteria": [
        "On the Intro page, the main paragraph renders in hex color #E8E8E8.",
        "The paragraph remains readable against the background and the color change is visible in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IntroPage.tsx",
          "operation": "modify",
          "description": "Replace the paragraph text color class currently using a theme token (e.g., `text-unicorn-silver`) with a Tailwind arbitrary value class that renders exactly #E8E8E8 (e.g., `text-[#E8E8E8]`). Ensure no copy/content changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update IntroPage CTA box background to use exact hex #669966 while preserving existing opacity/alpha and hover/transition behavior.",
      "acceptanceCriteria": [
        "On the Intro page, the clickable CTA box (that navigates to the proposal page) has a background color based on hex #669966.",
        "The CTA box still navigates to the next page when clicked.",
        "Hover/transition behavior remains present after the color update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IntroPage.tsx",
          "operation": "modify",
          "description": "Update the CTA container background class from the current theme token with opacity (e.g., `bg-thyme/80`) to a Tailwind arbitrary hex background with the same opacity (e.g., `bg-[#669966]/80`) so the alpha behavior is preserved. Do not alter the CTA click handler, navigation, or existing transition/hover classes."
        }
      ]
    }
  ]
}