{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore default background music asset and maintain autoplay/gesture fallback behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the missing default background music asset so the app can load it without showing an unavailable message.",
      "acceptanceCriteria": [
        "`frontend/public/assets/background-music.mp3` exists in the built frontend output and is fetchable at runtime via `/assets/background-music.mp3`.",
        "On a fresh load, the UI does not display the status message \"Default audio unavailable. Please choose a song file to play.\" when the default asset is present.",
        "No console error event is emitted from the `<audio>` element due to missing `/assets/background-music.mp3`."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/background-music.mp3",
          "operation": "create",
          "description": "Add the default background music file to the public assets directory so it is served at runtime from `/assets/background-music.mp3`."
        },
        {
          "path": "frontend/README-assets.md",
          "operation": "modify",
          "description": "Confirm the documentation references `frontend/public/assets/background-music.mp3` as the single source-of-truth and aligns diagnostics guidance with the restored default asset."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep BackgroundAudioProvider using `/assets/background-music.mp3` by default and preserve autoplay, user-gesture playback via the entry gate, and the manual Play Music fallback (plus local file override).",
      "acceptanceCriteria": [
        "On page load, the app attempts to autoplay the default track (a blocked autoplay is handled without crashing).",
        "If autoplay is blocked, clicking the app’s entry/gesture control triggers playback (where browser policy permits).",
        "If playback still fails after a gesture attempt, a visible \"Play Music\" button appears and attempts to start playback when clicked.",
        "The local file picker remains available and can override the default track by selecting a local audio file."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BackgroundAudioProvider.tsx",
          "operation": "modify",
          "description": "Ensure the default audio source remains `/assets/background-music.mp3`, preserve the existing autoplay attempt on mount, keep gesture-based playback via `playFromGesture`, and maintain the manual \"Play Music\" fallback visibility logic (only after a gesture attempt and playback failure). Also keep local file selection overriding the default source and clearing any default-unavailable status when a playable source loads."
        }
      ]
    }
  ]
}